# 캐글데이터_ titanic

# 1. 데이터 전처리

In [88]:
import pandas as pd
df = pd.read_csv("train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [89]:
# 결측치확인
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## 결측치 처리

### - AGE 결측치처리

In [90]:
# 평균값으로 대치할 것 
import numpy as np
np.mean(df['Age'])  # 29.69911764705882

29.69911764705882

In [91]:
df['Age'].isnull # 확인

<bound method Series.isnull of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64>

In [126]:
for i in range(len(df['Age'])):
    if pd.isnull(df['Age'][i]) == True:
          df['Age'][i] = np.mean(df['Age'])  # AGE의 NA만 평균값 대치

In [125]:
df['Age'] # 확인

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [94]:
df.isna().sum() # age 결측치 사라짐 확인

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

 ### -Embarked 결측치 처리

In [95]:
# 최빈값으로 대치할 것 
df['Embarked'].mode() # S

0    S
dtype: object

In [97]:
for i in range(len(df['Embarked'])):
    if pd.isnull(df['Embarked'][i]) == True:
          df['Embarked'][i] = df['Embarked'].mode()  # AGE의 NA만 평균값 대치

In [98]:
df.isna().sum() # 'Embarked 결측치 사라짐 확인

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

# - KNN IMPUTER 결측치 채우기

In [24]:
from sklearn.impute import KNNImputer

In [25]:
imputer = KNNImputer(n_neighbors=2)

In [29]:
type(df)

pandas.core.frame.DataFrame

In [100]:
# data_filled = imputer.fit_transform(df['Age'])
# pd.DataFrame(data_filled)

## 데이터 인코딩_문자열 처리

In [130]:
# 'Sex','Embarked' 가 문자열 데이터임 => 처리 必
# 레이블 인코딩
from sklearn.preprocessing import LabelEncoder

In [166]:
# 'Sex'
items = df['Sex']
labels_sex = LabelEncoder().fit_transform(items) #; labels_sex
df['Sex'] =labels_sex # 문자열 숫자로 바꿈

# 2. 독립변수 종속변수 설정

### x
sex : o

Age : o

pclass : Ticket class ; o 

sibsp : # of siblings / spouses aboard the Titanic : o

parch : # of parents / children aboard the Titanic : o

ticket : Ticket number : x

name : x

fare : Passenger fare : x

cabin :Cabin number : x

Embarked: Port of Embarkation : o

In [167]:
# x
df.data = df[[ 'Pclass','Sex','Age','SibSp','Parch' ]]
df.data

     Pclass  Sex        Age  SibSp  Parch
0         3    1  22.000000      1      0
1         1    0  38.000000      1      0
2         3    0  26.000000      0      0
3         1    0  35.000000      1      0
4         3    1  35.000000      0      0
..      ...  ...        ...    ...    ...
886       2    1  27.000000      0      0
887       1    0  19.000000      0      0
888       3    0  29.699118      1      2
889       1    1  26.000000      0      0
890       3    1  32.000000      0      0

[891 rows x 5 columns]

In [168]:
# y
df.target = df['Survived']  ; df.target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [169]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

# 3. train /test data set 분리

In [170]:
from sklearn.model_selection import train_test_split

In [171]:
X_train, X_test, y_train, y_test = train_test_split( 
 df.data, df.target, test_size=0.2, random_state=2021,
 stratify = df.target # 불균형하게 데이터가 분포되어있을 경우 stratefy 속성을 추가해야함 
)

In [172]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((712, 5), (179, 5), (712,), (179,))

In [173]:
pd.Series(y_test).value_counts()

0    110
1     69
Name: Survived, dtype: int64

# 4. 모델 생성 학습

In [174]:
# 의사결정나무
from sklearn.tree import DecisionTreeClassifier

In [175]:
dtc = DecisionTreeClassifier(random_state= 2021)
dtc.fit(X_train, y_train)

DecisionTreeClassifier(random_state=2021)

In [176]:
pred = dtc.predict(X_test)

# 5. 모델 성능평가

In [177]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test, pred)

0.7932960893854749

# 5.5 교차검증

# 6. 최적파라미터 도출

In [178]:
from sklearn.model_selection import GridSearchCV

In [179]:
params = {
    'max_depth' : [2,4,6],
    'min_samples_split' : [2,3,4]
}

In [180]:
dtc = DecisionTreeClassifier(random_state=2021)
grid_dtc = GridSearchCV(dtc, param_grid = params, cv = 3)
grid_dtc.fit(X_train,y_train)

GridSearchCV(cv=3, estimator=DecisionTreeClassifier(random_state=2021),
             param_grid={'max_depth': [2, 4, 6],
                         'min_samples_split': [2, 3, 4]})

In [181]:
grid_dtc.best_score_

0.7949863489699678

In [182]:
grid_dtc.best_params_ # 최적 파라미터

{'max_depth': 6, 'min_samples_split': 4}

In [183]:
# best estimator로 예측
pred = grid_dtc.best_estimator_.predict(X_test)
accuracy_score(y_test,pred) # 평가

0.8212290502793296